# def sum_numbers(a, b):
#     print(a + b)
# sum_numbers(5, 7)

# ----------------------------------------------------------------------------------------------------------------------------

# def greet(name):
#     print(f"გამარჯობა, {name}!")
# greet('ანდრია')

# ----------------------------------------------------------------------------------------------------------------------------

def parameters(a, b, c, d, e):
    print(a)
    print(b)
    print(c)
    print(d)
    print(e)
parameters(10, 20, "გ", True, 3.14)