# custom ფუნქცია არის ჩვენს მიერ შექმნილი ფუნქცია რომელსაც მაშინ ვიყენებთ როდესაც ერთნაირი კოდი ხშირად გვჭირდება

# def csttwonum(a, b):
#     return a + b
# print(csttwonum(2, 3)) 


# -------------------------------------------------------------------------------------------------------------

# def oddoreven(num):
#     if num % 2 == 0:
#         print("რიცხვი ლუწია")
#     else:
#         print("რიცხვი კენტია")

# ---------------------------------------------------------------------------------------------------------------------


# def square(num):
#     return num ** 2
# print(square(5)) 

# ------------------------------------------------------------------------------------------------------------------------------

# def to_uppercase(text):
    # return text.upper()
# print(to_uppercase("hello world"))         

# -------------------------------------------------------------------------------------------------------------------------------------

def saxgvar(name, surname):
    return f"ჩემი სახელი {name} და გვარი {surname}."

# მაგალითი:
print(saxgvar("ანდრია", "მოლაშვილი"))
# შედეგი: ჩემი სახელია ანდრია და გვარია ჯოხაძე