# while - ციკლი:როდესაც არ ვიცით რა რაოდენობის დაპრინტვა გვინდა.
# for - ციკლი:როდესაც ვიცით რა რაოდენობის დაპრინტვა გვინდა.

# ------------------------------------------------------------------

# for i in range(101):
#     print('Goa is the best')

# goa = 0
# while goa < 100:
#     print("GOA BEST!!!")
#     goa += 1

# ------------------------------------------------------------------

# ricxvi = 10
# while ricxvi >= 1:
#     print(ricxvi)
#     ricxvi -= 1

# ------------------------------------------------------------------

# ricxvi = 1
# ricxvebis_jami = 0
# while ricxvi <= 50:
#     ricxvebis_jami += ricxvi
#     ricxvi += 1
# print('ჯამი 1-დან 50-მდე არის:', ricxvebis_jami)

# ------------------------------------------------------------------

# names = ["ნიკა", "თეო", "ანა", "გიო"]

# raodenoba = 0
# for name in names:
#     raodenoba += 1
# print('სიაში მოცემულია', raodenoba, 'სახელი')

# ------------------------------------------------------------------

# for i in range(7):
#     print('მე მიყვარს პროგრამირება')



