def say_hello():
    print('Hello!')
say_hello()

# ------------------------------------------------------------------------------------------

def greet(name):
    print(f"გამარჯობა, {name}")
greet('Zuka')

# ------------------------------------------------------------------------------------------

def math(a, b):
    print('ჯამი', a + b)
print(math(3, 9))

# ------------------------------------------------------------------------------------------

def food(საჭმელი):
    print(f'მე ვჭამ {საჭმელი}')
food('Yveliani Puri')