print(4 + 4)
print(5 + 7)
print(5 + 12)

# -----------------------

print(44 - 4)
print(51 - 7)
print(56 - 12)

# -----------------------

print(4 * 4)
print(5 * 7)
print(5 * 12)

# -----------------------

print(4 / 8)
print(5 / 25)
print(6 / 12)

# -----------------------

print(4 % 8)
print(5 % 25)
print(6 % 12)

# -----------------------

print(4 ** 3)
print(5 ** 3)
print(6 ** 3)

# -----------------------

# /-სა და %-ს შორის განსხვავება ის არის,რომ ერთი გაყოფაა და მეორე ნაშთიანი გაყოფა

# -----------------------

deda = int(input('შეიყვანეთ ასაკი:'))
mama = int(input('შეიყვანეთ ასაკი:'))
da = int(input('შეიყვანეთ ასაკი:'))
zma = int(input('შეიყვანეთ ასაკი:'))

print(deda + mama + da + zma)

